RT-Thread/rt-thread/bsp/efm32/Libraries/CMSIS/CM3/DeviceSupport/EnergyMicro/EFM32/efm32g880f32.h
/** @} End of group EFM32G880F32_Peripheral_TypeDefs */

/**************************************************************************//**
 * @defgroup EFM32G880F32_Peripheral_Base EFM32G880F32 Peripheral Memory Map
 * @{
 *****************************************************************************/

#define MSC_BASE          (0x400C0000UL) /**< MSC base address  */
#define EMU_BASE          (0x400C6000UL) /**< EMU base address  */
#define RMU_BASE          (0x400CA000UL) /**< RMU base address  */
#define CMU_BASE          (0x400C8000UL) /**< CMU base address  */
#define AES_BASE          (0x400E0000UL) /**< AES base address  */
#define EBI_BASE          (0x40008000UL) /**< EBI base address  */
#define GPIO_BASE         (0x40006000UL) /**< GPIO base address  */
#define PRS_BASE          (0x400CC000UL) /**< PRS base address  */
#define DMA_BASE          (0x400C2000UL) /**< DMA base address  */
#define TIMER0_BASE       (0x40010000UL) /**< TIMER0 base address  */
#define TIMER1_BASE       (0x40010400UL) /**< TIMER1 base address  */
#define TIMER2_BASE       (0x40010800UL) /**< TIMER2 base address  */
#define USART0_BASE       (0x4000C000UL) /**< USART0 base address  */
#define USART1_BASE       (0x4000C400UL) /**< USART1 base address  */
#define USART2_BASE       (0x4000C800UL) /**< USART2 base address  */
#define UART0_BASE        (0x4000E000UL) /**< UART0 base address  */
#define LEUART0_BASE      (0x40084000UL) /**< LEUART0 base address  */
#define LEUART1_BASE      (0x40084400UL) /**< LEUART1 base address  */
#define LETIMER0_BASE     (0x40082000UL) /**< LETIMER0 base address  */
#define PCNT0_BASE        (0x40086000UL) /**< PCNT0 base address  */
#define PCNT1_BASE        (0x40086400UL) /**< PCNT1 base address  */
#define PCNT2_BASE        (0x40086800UL) /**< PCNT2 base address  */
#define I2C0_BASE         (0x4000A000UL) /**< I2C0 base address  */
#define ADC0_BASE         (0x40002000UL) /**< ADC0 base address  */
#define DAC0_BASE         (0x40004000UL) /**< DAC0 base address  */
#define ACMP0_BASE        (0x40001000UL) /**< ACMP0 base address  */
#define ACMP1_BASE        (0x40001400UL) /**< ACMP1 base address  */
#define VCMP_BASE         (0x40000000UL) /**< VCMP base address  */
#define LCD_BASE          (0x4008A000UL) /**< LCD base address  */
#define RTC_BASE          (0x40080000UL) /**< RTC base address  */
#define WDOG_BASE         (0x40088000UL) /**< WDOG base address  */
#define CALIBRATE_BASE    (0x0FE08000UL) /**< CALIBRATE base address */
#define DEVINFO_BASE      (0x0FE081B0UL) /**< DEVINFO base address */
#define ROMTABLE_BASE     (0xE00FFFD0UL) /**< ROMTABLE base address */

/** @} End of group EFM32G880F32_Peripheral_Base */

/**************************************************************************//**
 * @defgroup EFM32G880F32_Peripheral_Declaration  EFM32G880F32 Peripheral Declarations
 * @{
 *****************************************************************************/

#define MSC          ((MSC_TypeDef *)MSC_BASE)             /**< MSC base pointer */
#define EMU          ((EMU_TypeDef *)EMU_BASE)             /**< EMU base pointer */
#define RMU          ((RMU_TypeDef *)RMU_BASE)             /**< RMU base pointer */
#define CMU          ((CMU_TypeDef *)CMU_BASE)             /**< CMU base pointer */
#define AES          ((AES_TypeDef *)AES_BASE)             /**< AES base pointer */
#define EBI          ((EBI_TypeDef *)EBI_BASE)             /**< EBI base pointer */
#define GPIO         ((GPIO_TypeDef *)GPIO_BASE)           /**< GPIO base pointer */
#define PRS          ((PRS_TypeDef *)PRS_BASE)             /**< PRS base pointer */
#define DMA          ((DMA_TypeDef *)DMA_BASE)             /**< DMA base pointer */
#define TIMER0       ((TIMER_TypeDef *)TIMER0_BASE)        /**< TIMER0 base pointer */
#define TIMER1       ((TIMER_TypeDef *)TIMER1_BASE)        /**< TIMER1 base pointer */
#define TIMER2       ((TIMER_TypeDef *)TIMER2_BASE)        /**< TIMER2 base pointer */
#define USART0       ((USART_TypeDef *)USART0_BASE)        /**< USART0 base pointer */
#define USART1       ((USART_TypeDef *)USART1_BASE)        /**< USART1 base pointer */
#define USART2       ((USART_TypeDef *)USART2_BASE)        /**< USART2 base pointer */
#define UART0        ((USART_TypeDef *)UART0_BASE)         /**< UART0 base pointer */
#define LEUART0      ((LEUART_TypeDef *)LEUART0_BASE)      /**< LEUART0 base pointer */
#define LEUART1      ((LEUART_TypeDef *)LEUART1_BASE)      /**< LEUART1 base pointer */
#define LETIMER0     ((LETIMER_TypeDef *)LETIMER0_BASE)    /**< LETIMER0 base pointer */
#define PCNT0        ((PCNT_TypeDef *)PCNT0_BASE)          /**< PCNT0 base pointer */
#define PCNT1        ((PCNT_TypeDef *)PCNT1_BASE)          /**< PCNT1 base pointer */
#define PCNT2        ((PCNT_TypeDef *)PCNT2_BASE)          /**< PCNT2 base pointer */
#define I2C0         ((I2C_TypeDef *)I2C0_BASE)            /**< I2C0 base pointer */
#define ADC0         ((ADC_TypeDef *)ADC0_BASE)            /**< ADC0 base pointer */
#define DAC0         ((DAC_TypeDef *)DAC0_BASE)            /**< DAC0 base pointer */
#define ACMP0        ((ACMP_TypeDef *)ACMP0_BASE)          /**< ACMP0 base pointer */
#define ACMP1        ((ACMP_TypeDef *)ACMP1_BASE)          /**< ACMP1 base pointer */
#define VCMP         ((VCMP_TypeDef *)VCMP_BASE)           /**< VCMP base pointer */
#define LCD          ((LCD_TypeDef *)LCD_BASE)             /**< LCD base pointer */
#define RTC          ((RTC_TypeDef *)RTC_BASE)             /**< RTC base pointer */
#define WDOG         ((WDOG_TypeDef *)WDOG_BASE)           /**< WDOG base pointer */
#define CALIBRATE    ((CALIBRATE_TypeDef *)CALIBRATE_BASE) /**< CALIBRATE base pointer */
#define DEVINFO      ((DEVINFO_TypeDef *)DEVINFO_BASE)     /**< DEVINFO base pointer */
#define ROMTABLE     ((ROMTABLE_TypeDef *)ROMTABLE_BASE)   /**< ROMTABLE base pointer */

/** @} End of group EFM32G880F32_Peripheral_Declaration */

/**************************************************************************//**
 * @defgroup EFM32G880F32_BitFields EFM32G880F32 Bit Fields
 * @{
 *****************************************************************************/

/**************************************************************************//**
 * @defgroup EFM32G880F32_PRS EFM32G880F32 PRS
 * @{
 * @brief PRS Signal names
 *****************************************************************************/

