RT-Thread/rt-thread/bsp/efm32/Libraries/CMSIS/CM3/DeviceSupport/EnergyMicro/EFM32/efm32g880f32.h
/** @} End of group EFM32G880F32_AF_Pins */

/** Grouped by channel c, function f */
#define AF_PORT(c, f)    (                   \
    (c) == 0 ? AF_CMU_CLK0_PORT((f)) :       \
    (c) == 1 ? AF_CMU_CLK1_PORT((f)) :       \
    (c) == 2 ? AF_EBI_AD00_PORT((f)) :       \
    (c) == 3 ? AF_EBI_AD01_PORT((f)) :       \
    (c) == 4 ? AF_EBI_AD02_PORT((f)) :       \
    (c) == 5 ? AF_EBI_AD03_PORT((f)) :       \
    (c) == 6 ? AF_EBI_AD04_PORT((f)) :       \
    (c) == 7 ? AF_EBI_AD05_PORT((f)) :       \
    (c) == 8 ? AF_EBI_AD06_PORT((f)) :       \
    (c) == 9 ? AF_EBI_AD07_PORT((f)) :       \
    (c) == 10 ? AF_EBI_AD08_PORT((f)) :      \
    (c) == 11 ? AF_EBI_AD09_PORT((f)) :      \
    (c) == 12 ? AF_EBI_AD10_PORT((f)) :      \
    (c) == 13 ? AF_EBI_AD11_PORT((f)) :      \
    (c) == 14 ? AF_EBI_AD12_PORT((f)) :      \
    (c) == 15 ? AF_EBI_AD13_PORT((f)) :      \
    (c) == 16 ? AF_EBI_AD14_PORT((f)) :      \
    (c) == 17 ? AF_EBI_AD15_PORT((f)) :      \
    (c) == 18 ? AF_EBI_CS0_PORT((f)) :       \
    (c) == 19 ? AF_EBI_CS1_PORT((f)) :       \
    (c) == 20 ? AF_EBI_CS2_PORT((f)) :       \
    (c) == 21 ? AF_EBI_CS3_PORT((f)) :       \
    (c) == 22 ? AF_EBI_WEn_PORT((f)) :       \
    (c) == 23 ? AF_EBI_REn_PORT((f)) :       \
    (c) == 24 ? AF_EBI_ARDY_PORT((f)) :      \
    (c) == 25 ? AF_EBI_ALE_PORT((f)) :       \
    (c) == 26 ? AF_TIMER0_CC0_PORT((f)) :    \
    (c) == 27 ? AF_TIMER0_CC1_PORT((f)) :    \
    (c) == 28 ? AF_TIMER0_CC2_PORT((f)) :    \
    (c) == 29 ? AF_TIMER0_CDTI0_PORT((f)) :  \
    (c) == 30 ? AF_TIMER0_CDTI1_PORT((f)) :  \
    (c) == 31 ? AF_TIMER0_CDTI2_PORT((f)) :  \
    (c) == 32 ? AF_TIMER1_CC0_PORT((f)) :    \
    (c) == 33 ? AF_TIMER1_CC1_PORT((f)) :    \
    (c) == 34 ? AF_TIMER1_CC2_PORT((f)) :    \
    (c) == 35 ? AF_TIMER1_CDTI0_PORT((f)) :  \
    (c) == 36 ? AF_TIMER1_CDTI1_PORT((f)) :  \
    (c) == 37 ? AF_TIMER1_CDTI2_PORT((f)) :  \
    (c) == 38 ? AF_TIMER2_CC0_PORT((f)) :    \
    (c) == 39 ? AF_TIMER2_CC1_PORT((f)) :    \
    (c) == 40 ? AF_TIMER2_CC2_PORT((f)) :    \
    (c) == 41 ? AF_TIMER2_CDTI0_PORT((f)) :  \
    (c) == 42 ? AF_TIMER2_CDTI1_PORT((f)) :  \
    (c) == 43 ? AF_TIMER2_CDTI2_PORT((f)) :  \
    (c) == 44 ? AF_USART0_TX_PORT((f)) :     \
    (c) == 45 ? AF_USART0_RX_PORT((f)) :     \
    (c) == 46 ? AF_USART0_CLK_PORT((f)) :    \
    (c) == 47 ? AF_USART0_CS_PORT((f)) :     \
    (c) == 48 ? AF_USART1_TX_PORT((f)) :     \
    (c) == 49 ? AF_USART1_RX_PORT((f)) :     \
    (c) == 50 ? AF_USART1_CLK_PORT((f)) :    \
    (c) == 51 ? AF_USART1_CS_PORT((f)) :     \
    (c) == 52 ? AF_USART2_TX_PORT((f)) :     \
    (c) == 53 ? AF_USART2_RX_PORT((f)) :     \
    (c) == 54 ? AF_USART2_CLK_PORT((f)) :    \
    (c) == 55 ? AF_USART2_CS_PORT((f)) :     \
    (c) == 56 ? AF_UART0_TX_PORT((f)) :      \
    (c) == 57 ? AF_UART0_RX_PORT((f)) :      \
    (c) == 58 ? AF_UART0_CLK_PORT((f)) :     \
    (c) == 59 ? AF_UART0_CS_PORT((f)) :      \
    (c) == 60 ? AF_LEUART0_TX_PORT((f)) :    \
    (c) == 61 ? AF_LEUART0_RX_PORT((f)) :    \
    (c) == 62 ? AF_LEUART1_TX_PORT((f)) :    \
    (c) == 63 ? AF_LEUART1_RX_PORT((f)) :    \
    (c) == 64 ? AF_LETIMER0_OUT0_PORT((f)) : \
    (c) == 65 ? AF_LETIMER0_OUT1_PORT((f)) : \
    (c) == 66 ? AF_PCNT0_S0IN_PORT((f)) :    \
    (c) == 67 ? AF_PCNT0_S1IN_PORT((f)) :    \
    (c) == 68 ? AF_PCNT1_S0IN_PORT((f)) :    \
    (c) == 69 ? AF_PCNT1_S1IN_PORT((f)) :    \
    (c) == 70 ? AF_PCNT2_S0IN_PORT((f)) :    \
    (c) == 71 ? AF_PCNT2_S1IN_PORT((f)) :    \
    (c) == 72 ? AF_I2C0_SDA_PORT((f)) :      \
    (c) == 73 ? AF_I2C0_SCL_PORT((f)) :      \
    (c) == 74 ? AF_ACMP0_OUT_PORT((f)) :     \
    (c) == 75 ? AF_ACMP1_OUT_PORT((f)) :     \
    (c) == 76 ? AF_DBG_SWO_PORT((f)) :       \
    (c) == 77 ? AF_DBG_SWDIO_PORT((f)) :     \
    (c) == 78 ? AF_DBG_SWCLK_PORT((f)) :     \
    -1)

#define AF_PIN(c, f)     (                  \
    (c) == 0 ? AF_CMU_CLK0_PIN((f)) :       \
    (c) == 1 ? AF_CMU_CLK1_PIN((f)) :       \
    (c) == 2 ? AF_EBI_AD00_PIN((f)) :       \
    (c) == 3 ? AF_EBI_AD01_PIN((f)) :       \
    (c) == 4 ? AF_EBI_AD02_PIN((f)) :       \
    (c) == 5 ? AF_EBI_AD03_PIN((f)) :       \
    (c) == 6 ? AF_EBI_AD04_PIN((f)) :       \
    (c) == 7 ? AF_EBI_AD05_PIN((f)) :       \
    (c) == 8 ? AF_EBI_AD06_PIN((f)) :       \
    (c) == 9 ? AF_EBI_AD07_PIN((f)) :       \
    (c) == 10 ? AF_EBI_AD08_PIN((f)) :      \
    (c) == 11 ? AF_EBI_AD09_PIN((f)) :      \
    (c) == 12 ? AF_EBI_AD10_PIN((f)) :      \
    (c) == 13 ? AF_EBI_AD11_PIN((f)) :      \
    (c) == 14 ? AF_EBI_AD12_PIN((f)) :      \
    (c) == 15 ? AF_EBI_AD13_PIN((f)) :      \
    (c) == 16 ? AF_EBI_AD14_PIN((f)) :      \
    (c) == 17 ? AF_EBI_AD15_PIN((f)) :      \
    (c) == 18 ? AF_EBI_CS0_PIN((f)) :       \
    (c) == 19 ? AF_EBI_CS1_PIN((f)) :       \
    (c) == 20 ? AF_EBI_CS2_PIN((f)) :       \
    (c) == 21 ? AF_EBI_CS3_PIN((f)) :       \
    (c) == 22 ? AF_EBI_WEn_PIN((f)) :       \
    (c) == 23 ? AF_EBI_REn_PIN((f)) :       \
    (c) == 24 ? AF_EBI_ARDY_PIN((f)) :      \
    (c) == 25 ? AF_EBI_ALE_PIN((f)) :       \
    (c) == 26 ? AF_TIMER0_CC0_PIN((f)) :    \
    (c) == 27 ? AF_TIMER0_CC1_PIN((f)) :    \
    (c) == 28 ? AF_TIMER0_CC2_PIN((f)) :    \
    (c) == 29 ? AF_TIMER0_CDTI0_PIN((f)) :  \
    (c) == 30 ? AF_TIMER0_CDTI1_PIN((f)) :  \
    (c) == 31 ? AF_TIMER0_CDTI2_PIN((f)) :  \
    (c) == 32 ? AF_TIMER1_CC0_PIN((f)) :    \
    (c) == 33 ? AF_TIMER1_CC1_PIN((f)) :    \
    (c) == 34 ? AF_TIMER1_CC2_PIN((f)) :    \
    (c) == 35 ? AF_TIMER1_CDTI0_PIN((f)) :  \
    (c) == 36 ? AF_TIMER1_CDTI1_PIN((f)) :  \
    (c) == 37 ? AF_TIMER1_CDTI2_PIN((f)) :  \
    (c) == 38 ? AF_TIMER2_CC0_PIN((f)) :    \
    (c) == 39 ? AF_TIMER2_CC1_PIN((f)) :    \
    (c) == 40 ? AF_TIMER2_CC2_PIN((f)) :    \
    (c) == 41 ? AF_TIMER2_CDTI0_PIN((f)) :  \
    (c) == 42 ? AF_TIMER2_CDTI1_PIN((f)) :  \
    (c) == 43 ? AF_TIMER2_CDTI2_PIN((f)) :  \
    (c) == 44 ? AF_USART0_TX_PIN((f)) :     \
    (c) == 45 ? AF_USART0_RX_PIN((f)) :     \
    (c) == 46 ? AF_USART0_CLK_PIN((f)) :    \
    (c) == 47 ? AF_USART0_CS_PIN((f)) :     \
    (c) == 48 ? AF_USART1_TX_PIN((f)) :     \
    (c) == 49 ? AF_USART1_RX_PIN((f)) :     \
    (c) == 50 ? AF_USART1_CLK_PIN((f)) :    \
    (c) == 51 ? AF_USART1_CS_PIN((f)) :     \
    (c) == 52 ? AF_USART2_TX_PIN((f)) :     \
    (c) == 53 ? AF_USART2_RX_PIN((f)) :     \
    (c) == 54 ? AF_USART2_CLK_PIN((f)) :    \
    (c) == 55 ? AF_USART2_CS_PIN((f)) :     \
    (c) == 56 ? AF_UART0_TX_PIN((f)) :      \
    (c) == 57 ? AF_UART0_RX_PIN((f)) :      \
    (c) == 58 ? AF_UART0_CLK_PIN((f)) :     \
    (c) == 59 ? AF_UART0_CS_PIN((f)) :      \
    (c) == 60 ? AF_LEUART0_TX_PIN((f)) :    \
    (c) == 61 ? AF_LEUART0_RX_PIN((f)) :    \
    (c) == 62 ? AF_LEUART1_TX_PIN((f)) :    \
    (c) == 63 ? AF_LEUART1_RX_PIN((f)) :    \
    (c) == 64 ? AF_LETIMER0_OUT0_PIN((f)) : \
    (c) == 65 ? AF_LETIMER0_OUT1_PIN((f)) : \
    (c) == 66 ? AF_PCNT0_S0IN_PIN((f)) :    \
    (c) == 67 ? AF_PCNT0_S1IN_PIN((f)) :    \
    (c) == 68 ? AF_PCNT1_S0IN_PIN((f)) :    \
    (c) == 69 ? AF_PCNT1_S1IN_PIN((f)) :    \
    (c) == 70 ? AF_PCNT2_S0IN_PIN((f)) :    \
    (c) == 71 ? AF_PCNT2_S1IN_PIN((f)) :    \
    (c) == 72 ? AF_I2C0_SDA_PIN((f)) :      \
    (c) == 73 ? AF_I2C0_SCL_PIN((f)) :      \
    (c) == 74 ? AF_ACMP0_OUT_PIN((f)) :     \
    (c) == 75 ? AF_ACMP1_OUT_PIN((f)) :     \
    (c) == 76 ? AF_DBG_SWO_PIN((f)) :       \
    (c) == 77 ? AF_DBG_SWDIO_PIN((f)) :     \
    (c) == 78 ? AF_DBG_SWCLK_PIN((f)) :     \
    -1)

/** AF channel output count for channel c */
#define AF_COUNT(c)      ( \
    (c) == 0 ? 2 :         \
    (c) == 1 ? 2 :         \
    (c) == 2 ? 1 :         \
    (c) == 3 ? 1 :         \
    (c) == 4 ? 1 :         \
    (c) == 5 ? 1 :         \
    (c) == 6 ? 1 :         \
    (c) == 7 ? 1 :         \
    (c) == 8 ? 1 :         \
    (c) == 9 ? 1 :         \
    (c) == 10 ? 1 :        \
    (c) == 11 ? 1 :        \
    (c) == 12 ? 1 :        \
    (c) == 13 ? 1 :        \
    (c) == 14 ? 1 :        \
    (c) == 15 ? 1 :        \
    (c) == 16 ? 1 :        \
    (c) == 17 ? 1 :        \
    (c) == 18 ? 1 :        \
    (c) == 19 ? 1 :        \
    (c) == 20 ? 1 :        \
    (c) == 21 ? 1 :        \
    (c) == 22 ? 1 :        \
    (c) == 23 ? 1 :        \
    (c) == 24 ? 1 :        \
    (c) == 25 ? 1 :        \
    (c) == 26 ? 4 :        \
    (c) == 27 ? 4 :        \
    (c) == 28 ? 4 :        \
    (c) == 29 ? 4 :        \
    (c) == 30 ? 4 :        \
    (c) == 31 ? 4 :        \
    (c) == 32 ? 3 :        \
    (c) == 33 ? 3 :        \
    (c) == 34 ? 3 :        \
    (c) == 35 ? 0 :        \
    (c) == 36 ? 0 :        \
    (c) == 37 ? 0 :        \
    (c) == 38 ? 3 :        \
    (c) == 39 ? 3 :        \
    (c) == 40 ? 3 :        \
    (c) == 41 ? 0 :        \
    (c) == 42 ? 0 :        \
    (c) == 43 ? 0 :        \
    (c) == 44 ? 3 :        \
    (c) == 45 ? 3 :        \
    (c) == 46 ? 3 :        \
    (c) == 47 ? 3 :        \
    (c) == 48 ? 2 :        \
    (c) == 49 ? 2 :        \
    (c) == 50 ? 2 :        \
    (c) == 51 ? 2 :        \
    (c) == 52 ? 2 :        \
    (c) == 53 ? 2 :        \
    (c) == 54 ? 2 :        \
    (c) == 55 ? 2 :        \
    (c) == 56 ? 4 :        \
    (c) == 57 ? 4 :        \
    (c) == 58 ? 0 :        \
    (c) == 59 ? 0 :        \
    (c) == 60 ? 3 :        \
    (c) == 61 ? 3 :        \
    (c) == 62 ? 2 :        \
    (c) == 63 ? 2 :        \
    (c) == 64 ? 4 :        \
    (c) == 65 ? 4 :        \
    (c) == 66 ? 3 :        \
    (c) == 67 ? 3 :        \
    (c) == 68 ? 2 :        \
    (c) == 69 ? 2 :        \
    (c) == 70 ? 2 :        \
    (c) == 71 ? 2 :        \
    (c) == 72 ? 4 :        \
    (c) == 73 ? 4 :        \
    (c) == 74 ? 2 :        \
    (c) == 75 ? 2 :        \
    (c) == 76 ? 2 :        \
    (c) == 77 ? 2 :        \
    (c) == 78 ? 2 :        \
    -1)

/** @} End of group EFM32G880F32_Alternate_Function */

/**************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to update
 *  @param MASK
 *       The mask for the bit field to update
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 *****************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG)&~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EFM32G880F32  */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* __EFM32G880F32_H */
